# 8주차

## **수업에서 나눈 질문들**
### 함수의 개요

1. 함수
    - 함수는 한 가지 기능을 수행
    - 함수명은 기능에 가장 잘 맞는 특징을 살려서 지을 것

2. 잘 설계된 함수의 장점
    - 반복 실행해야 할 내용을 필요 시 호출
    - 모듈화되어 가독성 높고 디버깅에 수월
    - 기능과 구조 쉽게 파악
    - 타 프로그램에서 재사용 가능
    

### 함수 사용하기

1. 함수의 종류
    - 시스템 라이브러리 함수
        - 자주 사용하는 함수를 시스템에 미리 만들어놓은 것
    - 사용자 정의 함수

2. 함수의 정의 형태
    - 함수명 : 규칙에 따라 명명
    - 입력 : 자료형과 개수를 순서대로 나열
    - 반환 값 : 실행 후 반환되는 결과
    - 기능 : 해당 함수로 구현되는 내용

3. 함수의 선언 
    - 사용자 정의 함수는 선언을 함으로써 사용이 가능
    - 함수원형(prototype)
    - 정의하기 전에 선언

4. 함수의 호출
    - 정의한 형태에 맞춰 입출력을 고려하여 함수를 사용
    
    int x = 10, y = 20, value;
    
    call = SumTwo(x,y);
    

### 함수와 배열

- SumArray()
    - 배열: 식별자 작성 규칙에 따라 임의로 작성
    - 원소 개수: 배열명에는 대괄호를 사용하고, 실제 배열의 원소 개수는 두 번째 인자로 표시
    - 내용: 인자로 사용된 배열과 원소 개수를 이용해 필요한 기능 작성
    - 반환 값: 함수에서 계산된 결과 값 반환

### 재귀함수

1. 재귀호출
    - 함수를 다시 호출
    - N개로 된 문제가 N-1개의 문제 해결 시 간단하게 해결되는 경우 사용
2. factorial()함수
    - 함수에서 자신을 다시 호출
    - 종료 조건을 결정해야 무한히 반복하지 않음
